gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Convertir en 0-255        
  uint8_t result = (uint8_t)(expMapped * 255.0);        
          
  return result;        
}        
        
// Fonction pour mapping linéaire d'IR1 (dimmer)        
uint8_t mapIR1Linear(int rawValue) {        
  // Mapping linéaire simple pour les dimmers        
  return rawValue / 16; // 0-4095 ΓåÆ 0-255        
}        
        
// Fonction pour lire la valeur d'un contrôle assigné (0-4)        
uint8_t getControlValue(uint8_t source) {        
  switch(source) {        
    case 0: // IR1 (mapping linéaire pour dimmer)        
      return mapIR1Linear(readStabilizedIRSensor(DIST_SENSOR_1_PIN, irBuffer1, irIndex1, irSum1, irInitialized1));        
    case 1: // IR2        
      return readStabilizedIRSensor(DIST_SENSOR_2_PIN, irBuffer2, irIndex2, irSum2, irInitialized2) / 16;        
    case 2: // Fader1 (inversé)        
      return (4095 - analogRead(FADER_1_PIN)) / 16;        
    case 3: // Fader2 (inversé)        
      return (4095 - analogRead(FADER_2_PIN)) / 16;        
    case 4: // Fader3 (inversé)        
      return (4095 - analogRead(FADER_3_PIN)) / 16;        
    default:        
      return 0;        
  }        
}        
        
// Fonction pour mettre ├á jour le dimmer RGB avec inertie        
void updateRGBWithDimmer() {        
  // En mode web, utiliser les valeurs RGB du preset web courant        
  uint8_t rgb1Red, rgb1Green, rgb1Blue, rgb2Red, rgb2Green, rgb2Blue;        
        
    // Lecture des sources des dimmers depuis les paramètres        
    uint8_t dimmer1Source = getParameter("dimmer1_source");        
    uint8_t dimmer2Source = getParameter("dimmer2_source");        
    uint8_t control1Value;        
    uint8_t control2Value;        
            
            
          
  if (selectedPreset == 0 && webModeActive) {        
    // Mode web : utiliser les valeurs RGB de l'interface web (paramètres 24-26)        
    rgb1Red = parameters[24].value;    // rgb1_red        
    rgb1Green = parameters[25].value;  // rgb1_green        
    rgb1Blue = parameters[26].value;   // rgb1_blue        
    // Pour RGB2, utiliser les m├¬mes valeurs RGB que RGB1 en mode web        
    rgb2Red = parameters[24].value;        
    rgb2Green = parameters[25].value;        
    rgb2Blue = parameters[26].value;        
        
    control1Value = getControlValue(0); // IR1        
    control2Value = control1Value;        
  } else {        
    // Mode boîtier : utiliser les valeurs RGB des paramètres du preset        
    rgb1Red = getParameter("rgb1_red");        
    rgb1Green = getParameter("rgb1_green");        
    rgb1Blue = getParameter("rgb1_blue");        
    rgb2Red = getParameter("rgb2_red");        
    rgb2Green = getParameter("rgb2_green");        
    rgb2Blue = getParameter("rgb2_blue");        
        
    // Lecture des valeurs des contrôles assignés        
    control1Value = getControlValue(dimmer1Source);        
    control2Value = getControlValue(dimmer2Source);        
  }        
          
        
          
  // Mapping 50-255 ΓåÆ 0-255 (en dessous de 50 = éteint)        
  float rawDimmer1 = (float)control1Value / 255.0;        
  float rawDimmer2 = (float)control2Value / 255.0;        
          
  float targetDimmer1 = (rawDimmer1 < 0.196) ? 0.0 : (rawDimmer1 - 0.196) / (1.0 - 0.196); // 50/255 Γëê 0.196        
  float targetDimmer2 = (rawDimmer2 < 0.196) ? 0.0 : (rawDimmer2 - 0.196) / (1.0 - 0.196);        
          
  // Application de l'inertie        
  dimmerValue1 += (targetDimmer1 - dimmerValue1) * DIMMER_SPEED;        
  dimmerValue2 += (targetDimmer2 - dimmerValue2) * DIMMER_SPEED;        
          
  // Calcul des valeurs RGB dimmées        
  rgb1RedDimmed = (uint8_t)(rgb1Red * dimmerValue2); // Dimmer2 contrôle DMX RGB        
  rgb1GreenDimmed = (uint8_t)(rgb1Green * dimmerValue2);        
  rgb1BlueDimmed = (uint8_t)(rgb1Blue * dimmerValue2);        
          
  rgb2RedDimmed = (uint8_t)(rgb2Red * dimmerValue1); // Dimmer1 contrôle LED strip        
  rgb2GreenDimmed = (uint8_t)(rgb2Green * dimmerValue1);        
  rgb2BlueDimmed = (uint8_t)(rgb2Blue * dimmerValue1);        
          
  // Debug (optionnel)        
  static unsigned long lastDimmerDebugTime = 0;        
  // if (millis() - lastDimmerDebugTime > 2000) { // Debug toutes les 2 secondes        
  //   Serial.print("Dimmer - S1:");        
  //   Serial.print(dimmer1Source);        
  //   Serial.print(" S2:");        
  //   Serial.print(dimmer2Source);        
  //   Serial.print(" V1:");        
  //   Serial.print(control1Value);        
  //   Serial.print(" V2:");        
  //   Serial.print(control2Value);        
  //   Serial.print(" D1:");        
  //   Serial.print(dimmerValue1, 2);        
  //   Serial.print(" D2:");        
  //   Serial.print(dimmerValue2, 2);        
  //   Serial.println();        
  //   lastDimmerDebugTime = millis();        
  // }        
}        
        
        
        
// Fonction pour contrôler les paramètres via les entrées physiques         
// Les liens des contrôles sont maintenant lus dynamiquement depuis le preset actuel         
// Si un paramètre de lien vaut 0, le contrôle correspondant est désactivé         
void handlePhysicalControls() {        
  // Vérifier si on est en mode web (preset 0)        
  if (selectedPreset == 0) {        
    webModeActive = true;        
    handleWebPhysicalControls();        
    return; // IMPORTANT: Arr├¬ter complètement l'exécution ici        
  } else {        
    webModeActive = false;        
  }        
          
  // Lecture stabilisée des capteurs IR        
  int stabilizedIR1 = readStabilizedIRSensor(DIST_SENSOR_1_PIN, irBuffer1, irIndex1, irSum1, irInitialized1);        
  int stabilizedIR2 = readStabilizedIRSensor(DIST_SENSOR_2_PIN, irBuffer2, irIndex2, irSum2, irInitialized2);        
  uint8_t ir1Value = mapIR1Logarithmic(stabilizedIR1); // Mapping amélioré pour IR1        
  uint8_t ir2Value = stabilizedIR2 / 16; // 0-4095 ΓåÆ 0-255        
          
  // Lecture des faders (inversés : 4095-0 ΓåÆ 0-255)        
  //uint8_t fader1Value = (4095 - analogRead(FADER_1_PIN)) / 16; // 4095-0 ΓåÆ 0-255        
  uint8_t fader1Value = 0; // fader1 cassé, on le remplace par 0 en attendant de le réparer        
  uint8_t fader2Value = (4095 - analogRead(FADER_2_PIN)) / 16;        
  uint8_t fader3Value = (4095 - analogRead(FADER_3_PIN)) / 16;        
          
  // Lecture du bouton 3        
  bool button3State = !digitalRead(BUTTON_3_PIN);        
          
  // Lire les liens des contrôles directement depuis le preset actuel        
  uint8_t ir1TargetParam = getParameter("ir1_target_param");        
  uint8_t ir2TargetParam = getParameter("ir2_target_param");        
  uint8_t fader1TargetParam = getParameter("fader1_target_param");        
  uint8_t fader2TargetParam = getParameter("fader2_target_param");        
  uint8_t fader3TargetParam = getParameter("fader3_target_param");        
  uint8_t button3TargetParam = getParameter("button3_target_param");        
          
  // Appliquer les valeurs aux paramètres cibles selon les liens du preset        
  if (ir1TargetParam >= 0 && ir1TargetParam < PRESET_SIZE) {        
    setParameter(parameters[ir1TargetParam].name, ir1Value);        
  }        
          
  if (ir2TargetParam >= 0 && ir2TargetParam < PRESET_SIZE) {        
    setParameter(parameters[ir2TargetParam].name, ir2Value);        
  }        
          
      if (fader1TargetParam >= 0 && fader1TargetParam < PRESET_SIZE) {        
      setParameter(parameters[fader1TargetParam].name, fader1Value);        
    }        
            
    if (fader2TargetParam >= 0 && fader2TargetParam < PRESET_SIZE) {        
      setParameter(parameters[fader2TargetParam].name, fader2Value);        
    }        
            
    if (fader3TargetParam >= 0 && fader3TargetParam < PRESET_SIZE) {        
      setParameter(parameters[fader3TargetParam].name, fader3Value);        
    }        
        
        
