gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Gestion conditionnelle des faders selon l'état du filtre        
  //uint8_t filterState = getParameter("filter_on_off");         
        
  // if (filterState == 0) {        
  //   // Filter OFF : fader1 ΓåÆ vibrato_speed, fader2 ΓåÆ delay_time, fader3 ΓåÆ delay_feedback        
  //   setParameter("vibrato_speed", fader1Value);   // Paramètre 3        
  //   setParameter("delay_time", fader2Value);      // Paramètre 5        
  //   setParameter("delay_feedback", fader3Value);  // Paramètre 6        
  // } else {        
  //   // Filter ON : utiliser les assignations du preset        
  //   if (fader1TargetParam >= 0 && fader1TargetParam < PRESET_SIZE) {        
  //     setParameter(parameters[fader1TargetParam].name, fader1Value);        
  //   }        
            
  //   if (fader2TargetParam >= 0 && fader2TargetParam < PRESET_SIZE) {        
  //     setParameter(parameters[fader2TargetParam].name, fader2Value);        
  //   }        
            
  //   if (fader3TargetParam >= 0 && fader3TargetParam < PRESET_SIZE) {        
  //     setParameter(parameters[fader3TargetParam].name, fader3Value);        
  //   }        
  // }        
          
  // Gestion du bouton 3 avec valeurs released/pressed        
  if (button3TargetParam > 0 && button3TargetParam < PRESET_SIZE) {        
    uint8_t button3ReleasedValue = getParameter("button3_released_value");        
    uint8_t button3PressedValue = getParameter("button3_pressed_value");        
    uint8_t button3TargetValue = button3State ? button3PressedValue : button3ReleasedValue;        
    setParameter(parameters[button3TargetParam].name, button3TargetValue);        
  }        
          
  // Mettre ├á jour le dimmer RGB        
  updateRGBWithDimmer();        
          
  // Debug (optionnel)        
  static unsigned long lastDebugTime = 0;        
  // if (millis() - lastDebugTime > 1000) { // Debug toutes les secondes        
  //   Serial.print("Contrôles - IR1:");        
  //   Serial.print(ir1Value);        
  //   Serial.print(" IR2:");        
  //   Serial.print(ir2Value);        
  //   Serial.print(" F1:");        
  //   Serial.print(fader1Value);        
  //   Serial.print(" F2:");        
  //   Serial.print(fader2Value);        
  //   Serial.print(" F3:");        
  //   Serial.print(fader3Value);        
  //   Serial.print(" B3:");        
  //   Serial.print(button3State ? "ON" : "OFF");        
  //   Serial.println();        
  //   lastDebugTime = millis();        
  // }        
}        
        
// Fonction d'initialisation du rotary encoder (désactivée - encoder non c├óblé)        
/*        
void initializeEncoder() {        
  // Configuration des pins du rotary encoder        
  encoder.attachHalfQuad(ENCODER_A_PIN, ENCODER_B_PIN);        
  encoder.setCount(0);        
          
  // Configuration du bouton (optionnel)        
  pinMode(ENCODER_BUTTON_PIN, INPUT_PULLUP);        
          
  Serial.println("=== ROTARY ENCODER INITIALIS├ë ===");        
  Serial.println("Pins configurés:");        
  Serial.print("  - Pin A (CLK): D5 (GPIO18)");        
  Serial.println(" Γ£ô");        
  Serial.print("  - Pin B (DT): D6 (GPIO19)");        
  Serial.println(" Γ£ô");        
  Serial.print("  - Bouton (SW): D7 (GPIO23)");        
  Serial.println(" Γ£ô");        
  Serial.println("");        
  Serial.println("=== CONTROLES ===");        
  Serial.println("≡ƒöä Rotation: Modifie la valeur du paramètre actuel");        
  Serial.println("≡ƒöÿ Bouton: Change de paramètre (cycle 0-19)");        
  Serial.println("≡ƒôè Monitor: Affiche les changements en temps réel");        
  Serial.println("=====================================");        
}        
*/        
        
// Fonction pour gérer le rotary encoder (désactivée - encoder non c├óblé)        
/*        
void handleEncoder() {        
  // Lecture de la valeur actuelle du rotary encoder        
  int32_t currentEncoderValue = encoder.getCount();        
          
  // Si la valeur a changé, mettre ├á jour le paramètre sélectionné        
  if (currentEncoderValue != lastEncoderValue) {        
    int32_t delta = currentEncoderValue - lastEncoderValue;        
            
    // Obtenir la valeur actuelle du paramètre sélectionné        
    uint8_t currentValue = parameters[selectedParameter].value;        
            
    // Ajuster la valeur en fonction de la rotation        
    int newValue = currentValue + (delta * 2); // Multiplier par 2 pour un contrôle plus sensible        
            
    // Limiter la valeur entre 0 et 255        
    if (newValue < 0) newValue = 0;        
    if (newValue > 255) newValue = 255;        
            
    // Mettre ├á jour le paramètre        
    parameters[selectedParameter].value = (uint8_t)newValue;        
    dmxValues[parameters[selectedParameter].dmxChannel - 1] = (uint8_t)newValue;        
            
    // Afficher les informations détaillées de debug        
    Serial.print("≡ƒöä ROTATION: ");        
    if (delta > 0) {        
      Serial.print("+");        
    }        
    Serial.print(delta);        
    Serial.print(" | Encoder: ");        
    Serial.print(currentEncoderValue);        
    Serial.print(" | ");        
    Serial.print(parameters[selectedParameter].name);        
    Serial.print(" (DMX ");        
    Serial.print(parameters[selectedParameter].dmxChannel);        
    Serial.print("): ");        
    Serial.print(currentValue);        
    Serial.print(" ΓåÆ ");        
    Serial.print((uint8_t)newValue);        
    Serial.print(" [");        
    Serial.print((uint8_t)newValue * 100 / 255);        
    Serial.println("%]");        
            
    lastEncoderValue = currentEncoderValue;        
  }        
          
  // Gestion du bouton pour changer de paramètre        
  bool buttonState = !digitalRead(ENCODER_BUTTON_PIN); // Inversé car INPUT_PULLUP        
          
  if (buttonState && !encoderButtonPressed && (millis() - lastButtonPress > BUTTON_DEBOUNCE)) {        
    selectedParameter = (selectedParameter + 1) % PRESET_SIZE; // Passer au paramètre suivant        
            
    Serial.println("≡ƒöÿ BOUTON PRESS├ë - Changement de paramètre");        
    Serial.print("  ≡ƒôï Paramètre ");        
    Serial.print(selectedParameter);        
    Serial.print("/19: '");        
    Serial.print(parameters[selectedParameter].name);        
    Serial.print("'");        
    Serial.println("");        
    Serial.print("  ≡ƒôí DMX Channel: ");        
    Serial.print(parameters[selectedParameter].dmxChannel);        
    Serial.print(" | Valeur actuelle: ");        
    Serial.print(parameters[selectedParameter].value);        
    Serial.print(" [");        
    Serial.print(parameters[selectedParameter].value * 100 / 255);        
    Serial.println("%]");        
    Serial.println("  ΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇ");        
            
