gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
    encoderButtonPressed = true;        
    lastButtonPress = millis();        
  }        
          
  if (!buttonState) {        
    encoderButtonPressed = false;        
  }        
          
  // Affichage périodique du statut du rotary encoder        
  if (millis() - lastEncoderStatusTime >= ENCODER_STATUS_INTERVAL) {        
    Serial.println("≡ƒôè STATUT ROTARY ENCODER:");        
    Serial.print("  ≡ƒÄ» Paramètre actuel: ");        
    Serial.print(selectedParameter);        
    Serial.print("/19 - '");        
    Serial.print(parameters[selectedParameter].name);        
    Serial.println("'");        
    Serial.print("  ≡ƒôí DMX Channel: ");        
    Serial.print(parameters[selectedParameter].dmxChannel);        
    Serial.print(" | Valeur: ");        
    Serial.print(parameters[selectedParameter].value);        
    Serial.print(" [");        
    Serial.print(parameters[selectedParameter].value * 100 / 255);        
    Serial.println("%]");        
    Serial.print("  ≡ƒöó Compteur encoder: ");        
    Serial.println(encoder.getCount());        
    Serial.println("  ΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇΓöÇ");        
            
    lastEncoderStatusTime = millis();        
  }        
}        
*/        
        
/*Paramètres Ksoloti        
1 autopan depth        
2 pitch        
3 vibrato speed        
4 vibrato depth        
5 delay time        
6 delay feedback        
7 osc waveform        
8 gate threshold        
9 portamento time        
10 scale        
11 octave low high        
12 OSC 2 volume        
13 OSC 2 pitch offset        
14 autopan frequency        
15 scale tonic        
16 volume drums        
17 trig kick        
18 trig snare        
19 trig hh        
20 master volume (inverted)        
21 filter on-off         
22 filter cutoff        
23 filter reso        
24 filter type        
*/        
// Fonction d'initialisation des presets        
void initializePresets() {        
        
/*        
Targets : (0=IR1, 1=IR2, 2=Fader1, 3=Fader2, 4=Fader3)        
        
0  = autopan_depth           10  = octave_low_high         20 = filter_on_off            30 = button3_released_value        
1  = pitch                   11 = osc2_volume              21 = filter_cutoff            31 = button3_pressed_value        
2  = vibrato_speed           12 = osc2_pitch_offset        22 = filter_reso              32 = rgb1_red        
3  = vibrato_depth           13 = autopan_frequency        23 = filter_type              33 = rgb1_green        
4  = delay_time              14 = scale_tonic              24 = ir1_target_param         34 = rgb1_blue        
5  = delay_feedback          15 = volume_drums             25 = ir2_target_param         35 = rgb2_red        
6  = osc_waveform            16 = trig_kick                26 = fader1_target_param      36 = rgb2_green        
7  = gate_threshold          17 = trig_snare               27 = fader2_target_param      37 = rgb2_blue        
8  = portamento_time         18 = trig_hh                  28 = fader3_target_param      38 = dimmer1_source        
9  = scale                   19 = master_volume            29 = button3_target_param     39 = dimmer2_source        
*/        
  Serial.println("Initialisation des presets...");        
        
//                  |pandepth        |time           |porta          |osc2off       |kick       |master        |type             |fader2        |b3_pressed     /r2             /dim2        
//                       |pitch          |delFB          |scale         |autofreq       |snare      |filter         |ir1             |fader3        /r1             /g2        
//                           |vibraspeed     |osc            |octlow        |tonic          |hh         |cutoff         |ir2            |button3        /g1             /b2        
//                               |vibradepth     |gate           |osc2vol       |drums         |master     |reso            |fader1         |b3_rel         /b1             /dim1        
        
    // Preset 2 - Classical scale        
  //                 0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39          
  setAllParameters(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0, 0,  0,  0,  0);        
  savePreset(2, "Classical scale");        
        
      // Preset 3 - Classical scale siren        
  //                 0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39          
  setAllParameters(  0,  0, 100, 3, 74, 83,100,155,213,255,  0,  0,  0,  0,  0,255,  0,  0,  0,  0,  0,  0,  0,  0,  1, 15, 14,  4,  5, 18,  0,  5,255,  0,  50,255,0,  50,  0,  0);        
  savePreset(3, "Classical scale siren");        
        
      // Preset 0 - WEB MODE (pas d'assignations physiques)        
  //                 0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39          
  setAllParameters(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,255,  0,  50,255,0,  50,  0,  0);        
  savePreset(0, "WEB MODE");        
        
  // Preset 6 - Buzz1        
  //                 0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39          
  setAllParameters(  0,  0, 59, 16, 74, 83,100,155,213,  0,  0,  0,  0,  0,  0,255,  0,  0,  0,  0,  0,  0,  0,  0,  1, 15,  2,  4,  5, 18,  0,  5,255,  0,  50,255,0,  50,  0,  0);        
  savePreset(6, "Buzz1");        
        
  // Preset 1 - Bass growler        
  //                 0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39          
  setAllParameters(  0,  0, 59, 16, 74, 83,255,100,213,  0,  0,255,  0,  0,  0,255,  0,  0,  0,  0,  0,  0,  0,  0,  1,  0, 12,  4,  5, 18,  0,  5,255,  0,  50,255,0,  50,  0,  0);        
  savePreset(1, "Bass growler");        
          
        
  // Preset 5 - Furious octaver growl feedbacker        
  //                 0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39          
  setAllParameters(  0,150,221, 10, 74,241,255,  0, 91,255,  0,255,196,  0,  0,255,  0,  0,  0, 50,  0,  0,  0,  0, 12,  3, 21, 22, 6, 18,  0,  5,255,  0,  0,  0,255,  0,  0,  1);        
  savePreset(5, "FuriousGrowl");        
        
        
        
        
    // Preset 7 - ├Ç définir        
  //                 0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39          
  setAllParameters(  0,  0,  0,  0,  0,  0,  0,  120, 75, 50,  0,150, 150,  0, 0,255,  0,  0,  0,  0,  0,  0,  0,  0,  1,  3, 21, 22, 23, 18,  0,  5,  0,255, 15,200,10, 255, 0,  0);        
  savePreset(7, "Preset7");        
        
        
        
  // Preset 4 - Simple sans effet        
  //                 0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39          
  setAllParameters(  0,  0, 64, 10,  0,  0,100,  80, 75,  0,  0,  0,  0,  0,  0,255,  0,  0,  0, 0,  0,  0,  0,  0,  1,  3,  2,  4,  5, 18,  0,  5,255,  0,  0,  0,255,  0,  0,  1);        
  savePreset(4, "Simple");        
          
  // Preset 1 - Simple avec effet        
  //                 0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39          
  setAllParameters(  0,  0,  0,  0,130,110,100, 100, 30,  0,255,  0,  0,  0,  0,255,  0,  0,  0, 0,  0,  0,  0,  0,  1,  3,  2,  4,  5, 18,  0,  5,255,  0,  0,255,  0,  0,  0,  1);        
  savePreset(8, "Simple+Effet");        
          
  // // Preset 2 - Octaver and growl        
  // //                 0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39          
  // setAllParameters(  0,  0, 64, 10, 90,110,145,  0, 75,255,  0,255,140,  0,  0,255,  0,  0,  0, 0,  0,  0,  0,  0,  1,  3,  21, 22, 23, 18,  0,  5,255,255,  50,  0,255,255,  0,  1);        
  // savePreset(2, "OctaverGrowl");        
          
  // // Preset 3 - Modern siren vibrafrenzy        
  // //                 0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39          
  // setAllParameters(  0,  0,162,129,140,167,205,  0,108,  0,  0,  0,  0,  0,  0,255,  0,  0,  0,100,  0,  0,  0,  0,  1,  3,  2,  4,  5, 18,  0,  5,255,  0,  0,255,  0, 50,  0,  1);        
  // savePreset(3, "ModernSiren");        
          
        
          
          
        
          
        
          
          
  // Preset 9 - ├Ç définir        
  //                 0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39          
  setAllParameters(  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,255,  0,  0,  0,  0,  0,  0,  0,  0,  1,  3,  2,  4,  5, 18,  0,  5,255,  0,  0,  0,255,  0,  0,  1);        
  savePreset(9, "Preset9");        
          
  Serial.println("Presets initialisés");        
}        
// Fonctions d'interruption pour les boutons        
void IRAM_ATTR button1ISR() {        
  unsigned long interruptTime = millis();        
  if (interruptTime - buttonInterruptTimes[0] > BUTTON_DEBOUNCE) {        
    buttonInterruptFlags[0] = true;        
    buttonInterruptTimes[0] = interruptTime;        
  }        
}        
        
