gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
      // Mettre ├á jour le gate_threshold avec la nouvelle transposition        
      updateGateThresholdWithTranspose();        
    } else if (selectedPreset == 0) {        
      Serial.println("Bouton 1 - Transposition désactivée en mode web");        
    }        
    buttonInterruptFlags[0] = false;        
  }        
          
  // Traiter les interruptions du bouton 2 (incrémenter transposition)        
  if (buttonInterruptFlags[1]) {        
    // Ne pas traiter la transposition en mode web (preset 0)        
    if (selectedPreset != 0 && transpose < 12) {        
      transpose++;        
      Serial.print("Bouton 2 - Transposition incrémentée: ");        
      Serial.println(transpose);        
              
      // Afficher immédiatement la nouvelle transposition        
      displayUnified();        
              
      // Recharger le preset pour appliquer la nouvelle transposition        
      loadPreset(selectedPreset);        
              
      // Mettre ├á jour le gate_threshold avec la nouvelle transposition        
      updateGateThresholdWithTranspose();        
    } else if (selectedPreset == 0) {        
      Serial.println("Bouton 2 - Transposition désactivée en mode web");        
    }        
    buttonInterruptFlags[1] = false;        
  }        
          
  // Traiter les interruptions du bouton 3 (trig_hh)        
  if (buttonInterruptFlags[2]) {        
    dmxValues[118] = TRIG_LENGTH; // Canal DMX 119 (trig_hh)        
    Serial.println("Bouton 3 - Trig HH déclenché (ISR) - Durée: " + String(TRIG_LENGTH));        
    buttonInterruptFlags[2] = false;        
  }        
}        
        
        
// Fonction pour gérer l'encodeur KY-040        
void handleEncoder() {        
  int32_t currentEncoderValue = - encoder.getCount();        
          
  // Calculer le preset selon la formule : |valeur_encoder / 2| % 10        
  // Utiliser la valeur absolue pour éviter les problèmes avec les grandes valeurs négatives        
  int32_t normalizedValue = abs(currentEncoderValue / 2);        
  uint8_t newPreset = normalizedValue % MAX_PRESETS;        
          
  // Si le preset a changé        
  if (newPreset != selectedPreset) {        
    // Sauvegarder l'état web si on quitte le preset 0        
    if (selectedPreset == 0 && webModeActive) {        
      saveWebStateToPreset0();        
    }        
            
    selectedPreset = newPreset;        
            
    // Réinitialiser la transposition lors du changement de preset        
    transpose = 0;        
            
    // Charger le preset sélectionné        
    loadPreset(selectedPreset);        
            
    // Si on revient au preset 0, réinitialiser les paramètres web        
    if (selectedPreset == 0) {        
      resetWebParameters();        
    }        
            
    // Pas besoin d'updateGateThresholdWithTranspose() car transpose = 0        
            
    // Afficher le nouveau preset avec transposition réinitialisée        
    displayUnified();        
            
    // Debug sur le moniteur série        
    Serial.print("Preset changé: ");        
    Serial.print(selectedPreset);        
    Serial.print(" - ");        
    Serial.println(presets[selectedPreset].name);        
    Serial.println("Transposition réinitialisée ├á 0");        
  }        
          
  // Gestion du bouton de l'encodeur (toggle filtre)        
  bool encoderButtonState = !digitalRead(ENCODER_BUTTON_PIN);        
  if (encoderButtonState && !encoderButtonPressed && (millis() - lastEncoderButtonPress > BUTTON_DEBOUNCE)) {        
    uint8_t currentFilterState = getParameter("filter_on_off");        
    uint8_t newFilterState = (currentFilterState == 0) ? 255 : 0;        
    setParameter("filter_on_off", newFilterState);        
            
    // Afficher temporairement l'état du filtre        
    display.clear();        
    if (newFilterState == 255) {        
      display.showNumberDec(9999); // Afficher "9999" pour indiquer FILTRE ON        
    } else {        
      display.showNumberDec(0);    // Afficher "0000" pour indiquer FILTRE OFF        
    }        
            
    Serial.print("Filtre: ");        
    Serial.println((newFilterState == 255) ? "ON" : "OFF");        
            
    // Attendre 500ms puis revenir ├á l'affichage unifié        
    delay(500);        
    displayUnified();        
            
    encoderButtonPressed = true;        
    lastEncoderButtonPress = millis();        
  }        
          
  if (!encoderButtonState) {        
    encoderButtonPressed = false;        
  }        
}        
        
// Fonction pour afficher la transposition et le preset de manière unifiée        
void displayUnified() {        
  // Format: TTPP o├╣ TT = transposition/octave (-12 ├á +12) et PP = preset (0-9)        
  // Exemples:         
  // - Transposition +5, preset 3 ΓåÆ "0503"         
  // - Transposition -2, preset 7 ΓåÆ "-207"        
  // - Octave web +3, preset 0 ΓåÆ "0300"        
          
  uint8_t segments[4] = {0, 0, 0, 0};        
          
  // Choisir entre transposition physique et octave web        
  int8_t displayValue = (selectedPreset == 0 && webModeActive) ? webOctave : transpose;        
          
  // Calcul pour les digits de la transposition/octave (positions 0 et 1)        
  if (displayValue == 0) {        
    // Valeur = 0 : afficher "00"        
    segments[0] = display.encodeDigit(0);        
    segments[1] = display.encodeDigit(0);        
  } else if (displayValue > 0) {        
    // Valeur positive : afficher directement le nombre        
    if (displayValue >= 10) {        
      segments[0] = display.encodeDigit(displayValue / 10);        
      segments[1] = display.encodeDigit(displayValue % 10);        
    } else {        
      segments[0] = display.encodeDigit(0);        
      segments[1] = display.encodeDigit(displayValue);        
    }        
  } else {        
    // Valeur négative : afficher "-" + valeur absolue        
    segments[0] = 0x40; // Segment "-"        
    int absValue = -displayValue;        
    if (absValue >= 10) {        
      segments[1] = display.encodeDigit(absValue / 10);        
    } else {        
      segments[1] = display.encodeDigit(absValue);        
    }        
  }        
          
