gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Calcul pour les digits du preset (positions 2 et 3)        
  segments[2] = display.encodeDigit(0); // Toujours 0 car preset va de 0 ├á 9        
  segments[3] = display.encodeDigit(selectedPreset);        
          
  // Afficher les segments        
  display.setSegments(segments);        
}        
        
// Fonction pour mettre ├á jour l'afficheur TM1637        
void updateDisplay() {        
  if (millis() - lastDisplayUpdate >= DISPLAY_UPDATE_INTERVAL) {        
    // Utiliser la nouvelle fonction d'affichage unifiée        
    displayUnified();        
    lastDisplayUpdate = millis();        
  }        
}        
        
void setup()        
{        
  Serial.begin(115200);        
  Serial.println("=== Contrôleur Interactif ESP32 ===");        
  Serial.println("Initialisation...");        
          
  // Désactiver le Bluetooth pour améliorer la stabilité des lectures analogiques        
  btStop();        
  Serial.println("Bluetooth désactivé pour optimiser les lectures ADC");        
          
  // Afficher l'adresse MAC de l'ESP32        
  Serial.print("Adresse MAC ESP32: ");        
  Serial.println(WiFi.macAddress());        
          
  // Initialisation du tableau DMX ├á 0        
  for (int i = 0; i < 512; i++) {        
    dmxValues[i] = 0;        
  }        
          
  // Initialisation des paramètres        
  initializeParameters();        
          
  // Initialisation des presets        
  initializePresets();        
          
  // Chargement du preset 1 au démarrage        
  loadPreset(1);        
  selectedPreset = 1; // S'assurer que selectedPreset est correct        
          
  // Initialisation de l'interface utilisateur        
  initializeUserInterface();        
          
  // Affichage initial unifié        
  displayUnified();        
          
  // Configuration ESP-NOW        
  WiFi.mode(WIFI_STA);        
          
  if (esp_now_init() != ESP_OK) {        
    Serial.println("Erreur d'initialisation ESP-NOW");        
    return;        
  }        
          
  esp_now_register_send_cb(OnDataSent);        
        
          
  // Configuration du peer récepteur ESP8266 (unicast au lieu de broadcast)        
  memcpy(peerInfo.peer_addr, receiverAddress, 6);        
  peerInfo.channel = 0;        
  peerInfo.encrypt = false;        
          
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {        
    Serial.println("Erreur d'ajout du peer");        
    return;        
  }        
          
        
          
  Serial.println("ESP-NOW initialisé");        
  Serial.println("Mode: Unicast vers récepteur ESP8266");        
  Serial.print("Adresse MAC cible: ");        
  for (int i = 0; i < 6; i++) {        
    Serial.print(receiverAddress[i], HEX);        
    if (i < 5) Serial.print(":");        
  }        
  Serial.println();        
          
  // Initialisation de l'interface web        
  setupWebInterface();        
          
        
  Serial.println("Fréquence d'émission: " + String(EMISSION_FREQUENCY) + "Hz");        
  Serial.println("Capteurs Sharp IR sur GPIO35 et GPIO36");        
  Serial.println("Faders sur GPIO32, GPIO33, GPIO34");        
  Serial.println("Encodeur KY-040 sur GPIO26, GPIO27, GPIO25");        
  Serial.println("Afficheur TM1637 sur GPIO18, GPIO19");        
  Serial.println("  Format d'affichage: TTPP (TT=transposition, PP=preset)");        
  Serial.println("  Exemples: 0501=transpose +5/preset 1, -203=transpose -2/preset 3");        
  Serial.println("Boutons push sur GPIO21, GPIO22, GPIO23");        
  Serial.println("Bouton 1: Décrémenter transposition (-12 ├á +12)");        
  Serial.println("Bouton 2: Incrémenter transposition (-12 ├á +12)");        
  Serial.println("Bouton 3: Trig HH");        
  Serial.println("Bouton encodeur: Toggle filtre ON/OFF");        
        
  Serial.println("Transposition actuelle: " + String(transpose) + " (├ù" + String(transpose_factor) + ")");        
  Serial.println("Transposition appliquée au pitch et gate_threshold");        
  Serial.println("================================");        
}        
        
void sendDMXvalues()        
{        
  // Envoi des 4 paquets DMX (512 canaux divisés en 4 blocs de 128)        
  for (int packetNumber = 0; packetNumber < 4; packetNumber++)        
  {        
    outgoingDMXPacket.blockNumber = packetNumber;        
            
    // Remplir le paquet avec les 128 valeurs correspondantes        
    for (int i = 0; i < 128; i++)        
    {        
      int dmxIndex = (packetNumber * 128) + i;        
      if (dmxIndex < 512) {        
        outgoingDMXPacket.dmxvalues[i] = dmxValues[dmxIndex];        
      } else {        
        outgoingDMXPacket.dmxvalues[i] = 0;        
      }        
    }        
            
    // Envoi du paquet via ESP-NOW        
    esp_err_t result = esp_now_send(receiverAddress, (uint8_t *)&outgoingDMXPacket, sizeof(outgoingDMXPacket));        
            
    if (result == ESP_OK) {        
      //Serial.print(" [OK]");        
    } else {        
      Serial.print(" [ERREUR]");        
    }        
  }        
          
  // Décrémenter les canaux trig_kick, trig_snare et trig_hh après l'envoi        
  if (dmxValues[116] > 0) dmxValues[116]--; // Canal DMX 117 (trig_kick)        
  if (dmxValues[117] > 0) dmxValues[117]--; // Canal DMX 118 (trig_snare)        
  if (dmxValues[118] > 0) dmxValues[118]--; // Canal DMX 119 (trig_hh)        
          
  //Serial.println();        
}        
        
void setlights()        
{        
  // Canal DMX 1 : Mode de contrôle (0 = intensité rouge, 1 = autre mode, etc.)        
  dmxValues[0] = 0; // Mode intensité rouge        
          
  // Canaux DMX 2, 3, 4 : RGB1 dimmé par IR1        
  dmxValues[1] = rgb1RedDimmed;    // Canal DMX 2 (R)        
  dmxValues[2] = rgb1GreenDimmed;  // Canal DMX 3 (G)         
  dmxValues[3] = rgb1BlueDimmed;   // Canal DMX 4 (B)        
          
  // Mise ├á jour du ruban WS2812B avec RGB2 dimmé par IR2        
  for (int i = 0; i < NUM_LEDS; i++) {        
    leds[i] = CRGB(rgb2RedDimmed, rgb2GreenDimmed, rgb2BlueDimmed);        
  }        
          
  // Mettre ├á jour l'affichage        
  FastLED.show();        
}        
        
void testInputs() {        
  // Affichage compact des valeurs brutes        
          
  // Lecture des capteurs Sharp IR (valeurs brutes 0-4095)        
  int irRaw1 = analogRead(DIST_SENSOR_1_PIN);        
  int irRaw2 = analogRead(DIST_SENSOR_2_PIN);        
          
