gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Lecture des faders (valeurs brutes 0-4095)        
  int fader1Raw = analogRead(FADER_1_PIN);        
  int fader2Raw = analogRead(FADER_2_PIN);        
  int fader3Raw = analogRead(FADER_3_PIN);        
          
  // Lecture des boutons (0 ou 1)        
  bool button1State = !digitalRead(BUTTON_1_PIN); // Bouton 1 sur GPIO22        
  bool button2State = !digitalRead(BUTTON_2_PIN); // Bouton 2 sur GPIO21        
  bool button3State = !digitalRead(BUTTON_3_PIN);        
          
  // Lecture de l'encodeur        
  int32_t testEncoderValue = encoder.getCount();        
  bool encoderButtonState = !digitalRead(ENCODER_BUTTON_PIN);        
          
  // Mapper les faders sur 0-255 pour DMX 2, 3, 4 (inversés)        
  uint8_t fader1Mapped = (4095 - fader1Raw) / 16; // 4095-0 ΓåÆ 0-255        
  uint8_t fader2Mapped = (4095 - fader2Raw) / 16;        
  uint8_t fader3Mapped = (4095 - fader3Raw) / 16;        
          
  // Assigner aux canaux DMX 2, 3, 4        
  dmxValues[1] = fader1Mapped; // DMX 2 (Rouge)        
  dmxValues[2] = fader2Mapped; // DMX 3 (Vert)        
  dmxValues[3] = fader3Mapped; // DMX 4 (Bleu)        
          
  // Affichage compact sur une ligne        
  Serial.print("IR1 ");        
  Serial.print(irRaw1);        
  Serial.print(" | IR2 ");        
  Serial.print(irRaw2);        
  Serial.print(" | F1 ");        
  Serial.print(fader1Raw);        
  Serial.print(" | F2 ");        
  Serial.print(fader2Raw);        
  Serial.print(" | F3 ");        
  Serial.print(fader3Raw);        
  Serial.print(" | B1 ");        
  Serial.print(button1State ? "1" : "0");        
  Serial.print(" | B2 ");        
  Serial.print(button2State ? "1" : "0");        
  Serial.print(" | B3 ");        
  Serial.print(button3State ? "1" : "0");        
  Serial.print(" | ENC ");        
  Serial.print(testEncoderValue);        
  Serial.print(" | ENCB ");        
  Serial.print(encoderButtonState ? "1" : "0");        
  Serial.print(" | DMX2 ");        
  Serial.print(dmxValues[1]);        
  Serial.print(" | DMX3 ");        
  Serial.print(dmxValues[2]);        
  Serial.print(" | DMX4 ");        
  Serial.print(dmxValues[3]);        
  Serial.println();        
          
  // En mode test, afficher l'encodeur sur les 4 digits        
  display.clear();        
  uint16_t displayValue = abs(testEncoderValue) % 10000; // Limiter ├á 4 chiffres        
  display.showNumberDec(displayValue);        
          
  // Mettre ├á jour le LED strip avec les valeurs DMX 2, 3, 4        
  uint8_t redValue = dmxValues[1];    // Canal DMX 2 (R)        
  uint8_t greenValue = dmxValues[2];  // Canal DMX 3 (G)         
  uint8_t blueValue = dmxValues[3];   // Canal DMX 4 (B)        
          
  // Appliquer la couleur RGB ├á tous les LEDs du ruban        
  for (int i = 0; i < NUM_LEDS; i++) {        
    leds[i] = CRGB(redValue, greenValue, blueValue);        
  }        
          
  // Mettre ├á jour l'affichage        
  FastLED.show();        
}        
        
        
        
          
        
          
        
        
void loop()        
{        
  // Incrémenter le compteur d'affichage        
  displayCounter++;        
          
  if (CONTROL_TEST == 1) {        
    // affichage des valeurs brutes des capteurs, boutons, faders, encodeur        
    testInputs();        
    delay(500);        
  }        
  else // fonctionnement normal        
  {        
    // Gestion des contrôles physiques dynamiques (IR1, IR2, faders, bouton3)        
    handlePhysicalControls();        
            
    // Gestion de l'encodeur rotatif        
    handleEncoder();        
  }        
          
  // Lecture des faders        
 // readFaders();        
          
  // Gestion des boutons push        
  handleButtonInterrupts();        
          
  // Gestion du serveur web (limité ├á 10Hz pour éviter la surcharge)        
  static unsigned long lastWebServerUpdate = 0;        
  if (millis() - lastWebServerUpdate >= 100) { // 100ms = 10Hz        
    webServer.handleClient();        
    lastWebServerUpdate = millis();        
  }        
          
  // Gestion de l'encodeur KY-040        
 // handleEncoder();        
          
  // Mise ├á jour de l'afficheur TM1637        
  updateDisplay();        
          
  // ├ëmission ├á fréquence fixe (50Hz)        
  if (millis() - lastEmissionTime >= EMISSION_INTERVAL) {        
            
    setlights();        
    sendDMXvalues();        
    lastEmissionTime = millis();        
  }        
          
  delay(1); // Petit délai pour éviter de surcharger le CPU        
}        
        
// ============================================================================        
// IMPL├ëMENTATION DES FONCTIONS DE L'INTERFACE WEB        
// ============================================================================        
        
// Initialisation du système de fichiers et du serveur web        
void setupWebInterface() {        
  // Initialiser le système de fichiers avec formatage forcé si nécessaire        
  Serial.println("≡ƒöº Initialisation de LittleFS...");        
  if (!LittleFS.begin(true)) {        
    Serial.println("Γ¥î Première tentative échouée, formatage forcé...");        
    LittleFS.format();        
    if (!LittleFS.begin(true)) {        
      Serial.println("Γ¥î Erreur: Impossible d'initialiser LittleFS m├¬me après formatage");        
      return;        
    }        
  }        
  Serial.println("Γ£à LittleFS initialisé avec succès");        
          
  // Vérifier que l'écriture fonctionne en créant un fichier de test        
  File testFile = LittleFS.open("/test.txt", "w");        
  if (testFile) {        
    testFile.println("Test d'écriture LittleFS");        
    testFile.close();        
    Serial.println("Γ£à Test d'écriture LittleFS réussi");        
    LittleFS.remove("/test.txt"); // Nettoyer le fichier de test        
  } else {        
    Serial.println("Γ¥î Erreur: Impossible d'écrire dans LittleFS");        
  }        
          
  // Lister les fichiers disponibles        
  File root = LittleFS.open("/");        
  File file = root.openNextFile();        
  Serial.println("≡ƒôü Fichiers disponibles dans LittleFS:");        
  while (file) {        
    Serial.print("  - ");        
    Serial.print(file.name());        
    Serial.print(" (");        
    Serial.print(file.size());        
    Serial.println(" bytes)");        
    file = root.openNextFile();        
  }        
          
  // Créer le point d'accès WiFi        
  WiFi.softAP(AP_SSID, AP_PASSWORD);        
  Serial.print("≡ƒôí Point d'accès WiFi créé: ");        
  Serial.println(AP_SSID);        
  Serial.print("≡ƒöæ Mot de passe: ");        
  Serial.println(AP_PASSWORD);        
  Serial.print("≡ƒîÉ Adresse IP: ");        
  Serial.println(WiFi.softAPIP());        
          
  // Configurer les routes du serveur web        
  setupWebRoutes();        
          
  // Démarrer le serveur web        
  webServer.begin();        
  Serial.println("≡ƒîÉ Serveur web démarré");        
          
  // Initialiser les tableaux de presets web        
  for (int i = 0; i < MAX_WEB_PRESETS; i++) {        
    webPresets[i].name[0] = '\0'; // Marquer les slots comme vides        
    webPresets[i].octave = 0;     // Initialiser l'octave ├á 0        
  }        
          
  // Charger les presets web et assignations        
  Serial.println("≡ƒöä Début du chargement des presets web...");        
  loadWebPresets();        
  Serial.println("≡ƒöä Début du chargement des assignations web...");        
  loadWebAssignments();        
}        
        
