gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
      // Sauvegarder les assignations physiques reçues        
      if (assignments.size() == 4) {        
        for (int i = 0; i < 4; i++) {        
          webPresets[slot].assignments[i] = assignments[i];        
        }        
      } else {        
        // Fallback : utiliser les assignations actuelles si pas reçues        
        for (int i = 0; i < 4; i++) {        
          webPresets[slot].assignments[i] = webAssignments[i];        
        }        
      }        
              
      // Mettre à jour webPresetCount si nécessaire        
      if (slot >= webPresetCount) {        
        webPresetCount = slot + 1;        
      }        
              
      saveWebPresets();        
              
      DynamicJsonDocument response(128);        
      response["success"] = true;        
      response["message"] = "Preset sauvegardé";        
              
      String responseStr;        
      serializeJson(response, responseStr);        
      webServer.send(200, "application/json", responseStr);        
    } else {        
      webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Slot invalide ou données incorretes\"}");        
    }        
  } else {        
    webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Données manquantes\"}");        
  }        
}        
        
// API: Charger un preset web        
void handleLoadWebPreset() {        
  if (webServer.hasArg("plain")) {        
    DynamicJsonDocument doc(512);        
    deserializeJson(doc, webServer.arg("plain"));        
            
    int id = doc["id"];        
            
    // Vérifier que le slot existe et contient des données        
    if (id >= 0 && id < MAX_WEB_PRESETS && id < webPresetCount && strlen(webPresets[id].name) > 0) {        
      // Appliquer les valeurs du preset        
      for (int i = 0; i < 27; i++) {        
        parameters[i].value = webPresets[id].values[i];        
        dmxValues[parameters[i].dmxChannel - 1] = webPresets[id].values[i];        
      }        
              
      // Charger l'octave du preset        
      webOctave = webPresets[id].octave;        
              
      // Charger les assignations physiques du preset        
      for (int i = 0; i < 4; i++) {        
        webAssignments[i] = webPresets[id].assignments[i];        
      }        
              
      // Sauvegarder les assignations web mises à jour        
      saveWebAssignments();        
              
      // Appliquer l'octave aux paramètres sensibles        
      applyWebOctave();        
              
      // Mettre ├á jour l'affichage de l'octave        
      displayUnified();        
              
      lastWebPreset = id;        
              
      // Sauvegarder l'état dans le preset 0 pour persistance        
      saveWebStateToPreset0();        
              
      DynamicJsonDocument response(1024);        
      response["success"] = true;        
      response["message"] = "Preset chargé";        
              
      // Retourner les vraies valeurs des presets web (pas des paramètres actuels)        
      JsonArray paramsArray = response.createNestedArray("parameters");        
      for (int i = 0; i < 27; i++) {        
        paramsArray.add(webPresets[id].values[i]);        
      }        
              
      String responseStr;        
      serializeJson(response, responseStr);        
      webServer.send(200, "application/json", responseStr);        
    } else {        
      webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Preset non trouvé ou slot vide\"}");        
    }        
  } else {        
    webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Données manquantes\"}");        
  }        
}        
        
// API: Lister les presets web        
void handleListWebPresets() {        
  DynamicJsonDocument doc(2048);        
  JsonArray presetsArray = doc.createNestedArray("presets");        
          
  for (int i = 0; i < webPresetCount; i++) {        
    JsonObject preset = presetsArray.createNestedObject();        
    preset["name"] = webPresets[i].name;        
    preset["id"] = i;        
  }        
          
  String response;        
  serializeJson(doc, response);        
  webServer.send(200, "application/json", response);        
}        
        
// API: Gérer les octaves        
void handleOctave() {        
  if (webServer.hasArg("plain")) {        
    DynamicJsonDocument doc(512);        
    deserializeJson(doc, webServer.arg("plain"));        
            
    String direction = doc["direction"];        
            
    if (direction == "up" && webOctave < 12) {        
      webOctave++;        
    } else if (direction == "down" && webOctave > -12) {        
      webOctave--;        
    }        
            
    // Appliquer l'octave web directement (système séparé)        
    applyWebOctave();        
            
    // Afficher l'octave sur l'écran (utiliser webOctave au lieu de transpose)        
    if (selectedPreset == 0 && webModeActive) {        
      displayUnified();        
              
      Serial.print("≡ƒÄ╡ Octave web mise ├á jour: ");        
      Serial.println(webOctave);        
    }        
            
    DynamicJsonDocument response(256);        
    response["success"] = true;        
    response["octave"] = webOctave;        
    response["message"] = "Octave mise ├á jour";        
            
    String responseStr;        
    serializeJson(response, responseStr);        
    webServer.send(200, "application/json", responseStr);        
  } else {        
    webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Données manquantes\"}");        
  }        
}        
        
// Gestion des erreurs 404        
void handleNotFound() {        
  String path = webServer.uri();        
  Serial.print("Γ¥î 404 - Page non trouvée: ");        
  Serial.println(path);        
          
