gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Vérifier si le fichier existe dans LittleFS        
  if (LittleFS.exists(path)) {        
    Serial.println("  ΓÜá∩╕Å  Le fichier existe dans LittleFS mais n'a pas pu ├¬tre servi");        
  } else {        
    Serial.println("  Γ¥î Le fichier n'existe pas dans LittleFS");        
  }        
          
  String response = "Page non trouvée: " + path;        
  response += "\n\nFichiers disponibles:\n";        
          
  // Lister les fichiers disponibles        
  File root = LittleFS.open("/");        
  File file = root.openNextFile();        
  while (file) {        
    response += "- " + String(file.name()) + "\n";        
    file = root.openNextFile();        
  }        
          
  webServer.send(404, "text/plain", response);        
}        
        
        
        
        
// Sauvegarde des presets web dans LittleFS        
void saveWebPresets() {        
  File file = LittleFS.open("/web_presets.json", "w");        
  if (file) {        
    DynamicJsonDocument doc(4096);        
    JsonArray presetsArray = doc.createNestedArray("presets");        
            
    for (int i = 0; i < MAX_WEB_PRESETS; i++) {        
      // Sauvegarder seulement les slots qui contiennent des données        
      if (strlen(webPresets[i].name) > 0) {        
        JsonObject preset = presetsArray.createNestedObject();        
        preset["slot"] = i;  // Sauvegarder le numéro de slot        
        preset["name"] = webPresets[i].name;        
        preset["octave"] = webPresets[i].octave; // Sauvegarder l'octave        
                
        JsonArray valuesArray = preset.createNestedArray("values");        
        for (int j = 0; j < 27; j++) {        
          valuesArray.add(webPresets[i].values[j]);        
        }        
                
        // Sauvegarder les assignations physiques        
        JsonArray assignmentsArray = preset.createNestedArray("assignments");        
        for (int j = 0; j < 4; j++) {        
          assignmentsArray.add(webPresets[i].assignments[j]);        
        }        
      }        
    }        
            
    serializeJson(doc, file);        
    file.close();        
    Serial.println("≡ƒÆ╛ Presets web sauvegardés");        
  }        
}        
        
// Chargement des presets web depuis LittleFS        
void loadWebPresets() {        
  Serial.println("≡ƒöì DEBUG: Entrée dans loadWebPresets()");        
          
  // Vérifier d'abord si le fichier existe        
  Serial.println("≡ƒöì DEBUG: Vérification de l'existence du fichier...");        
  bool fileExists = LittleFS.exists("/web_presets.json");        
  Serial.print("≡ƒöì DEBUG: LittleFS.exists() retourne: ");        
  Serial.println(fileExists ? "TRUE" : "FALSE");        
          
  if (!fileExists) {        
    Serial.println("≡ƒôé Aucun preset web trouvé (première utilisation)");        
    webPresetCount = 0;        
    Serial.println("≡ƒöì DEBUG: Sortie de loadWebPresets() - fichier n'existe pas");        
    return;        
  }        
          
  Serial.println("≡ƒöì DEBUG: Fichier existe, tentative d'ouverture...");        
  File file = LittleFS.open("/web_presets.json", "r");        
  Serial.println("≡ƒöì DEBUG: Après appel LittleFS.open()");        
          
  if (file) {        
    Serial.println("≡ƒöì DEBUG: Fichier ouvert avec succès");        
    DynamicJsonDocument doc(4096);        
    deserializeJson(doc, file);        
    file.close();        
            
    JsonArray presetsArray = doc["presets"];        
    webPresetCount = 0;        
            
    for (JsonObject preset : presetsArray) {        
      int slot = preset["slot"]; // Récupérer le numéro de slot        
              
      if (slot >= 0 && slot < MAX_WEB_PRESETS) {        
        strcpy(webPresets[slot].name, preset["name"]);        
                
        // Charger l'octave (défaut ├á 0 si pas présent pour compatibilité)        
        webPresets[slot].octave = preset["octave"] | 0;        
                
        JsonArray valuesArray = preset["values"];        
        int i = 0;        
        for (JsonVariant value : valuesArray) {        
          if (i < 27) {        
            webPresets[slot].values[i] = value;        
            i++;        
          }        
        }        
                
        // Charger les assignations physiques (défaut à 0 si pas présent pour compatibilité)        
        if (preset.containsKey("assignments")) {        
          JsonArray assignmentsArray = preset["assignments"];        
          int j = 0;        
          for (JsonVariant assignment : assignmentsArray) {        
            if (j < 4) {        
              webPresets[slot].assignments[j] = assignment | 0;        
              j++;        
            }        
          }        
        } else {        
          // Compatibilité avec les anciens presets : initialiser les assignations à 0        
          for (int j = 0; j < 4; j++) {        
            webPresets[slot].assignments[j] = 0;        
          }        
        }        
                
        // Mettre à jour webPresetCount si nécessaire        
        if (slot >= webPresetCount) {        
          webPresetCount = slot + 1;        
        }        
      }        
    }        
            
    Serial.print("≡ƒôé ");        
    Serial.print(webPresetCount);        
    Serial.println(" presets web chargés");        
  } else {        
    Serial.println("≡ƒöì DEBUG: Impossible d'ouvrir le fichier");        
  }        
  Serial.println("≡ƒöì DEBUG: Sortie de loadWebPresets()");        
}        
        
// Sauvegarde des assignations dans LittleFS        
void saveWebAssignments() {        
  File file = LittleFS.open("/web_assignments.json", "w");        
  if (file) {        
    DynamicJsonDocument doc(512);        
    JsonArray assignmentsArray = doc.createNestedArray("assignments");        
            
    for (int i = 0; i < 4; i++) {        
      assignmentsArray.add(webAssignments[i]);        
    }        
            
    serializeJson(doc, file);        
    file.close();        
    Serial.println("≡ƒÆ╛ Assignations web sauvegardées");        
  }        
}        
        
// Chargement des assignations depuis LittleFS        
void loadWebAssignments() {        
  // Vérifier d'abord si le fichier existe        
  if (!LittleFS.exists("/web_assignments.json")) {        
    Serial.println("≡ƒöù Aucune assignation web trouvée (première utilisation)");        
    // Initialiser avec des valeurs par défaut (tout ├á OFF)        
    for (int i = 0; i < 4; i++) {        
      webAssignments[i] = 0;        
    }        
    return;        
  }        
          
